using System;
using System.Threading;

namespace LabWork3_Final
{
    class Program
    {
        //Метод, который выводит на экран содержимое массива
        //в форматированном виде
        static void ShowArray(int[] massive, string message)
        {
            if (massive.Length <= 500) //Если размер массива меньше 500 элементов, его содержимое выводится на экран
            {
                Console.WriteLine(message);
                for (int i = 0; i < massive.Length; i++)
                {
                    if (i > 0 && i % 10 == 0) Console.Write("\n"); //после вывода десяти элементов массива - перенос на новую строку
                    Console.Write("|" + massive[i] + "|\t"); //Добавляем разделители и табуляцию, чтобы красиво выглядело
                }
                Console.WriteLine();
            }
            else
            {
                Console.WriteLine("\nПрограмма выполняется. Массивы слишком велики для вывода на экран!");
            }
        }

        static int[] BubbleSort(int[] massive)
        {
            for (int k = 0; k < massive.Length; k++)
            {
                for (int i = 0; i < massive.Length - 1; i++)
                {
                    if (massive[i] > massive[i + 1]) // Последовательно сравниваем элементы 
                    {                                                  // Больший элемент постепенно движется к концу массива
                        int Temp;   //Временная переменная для обмена большего элемента с меньшим 
                        Temp = massive[i + 1]; //Больший элемент движется к концу массива
                        massive[i + 1] = massive[i];
                        massive[i] = Temp;
                    }
                }
            }
            return massive;
        }
        static void Main(string[] args)
        {
            // Лабораторная работа № 3 "Обработка одномерных массивов"
            // Вариант 11
            // Найти: Повторяющиеся элементы массива А, которые есть в массиве B

            //Размерность массивов определяется аргументом коммандной строки
            // Если аргумент не задан (равен нулю), по умолчанию 100
            
            //Описание программы:

            Console.WriteLine("Лабораторная работа 3 по теме \"Обработка одномерных массивов\"");
            Console.WriteLine("по предмету \"Программирование на языках высокого уровня\"");
            Console.WriteLine("Создаются два массива заданной размерности (по умолчанию 100)");
            Console.WriteLine("Массивы сортируются Пузырьком. Далее происходит поиск элементов");
            Console.WriteLine("которые повторяются в первом массиве и встречаются во втором");
            Console.WriteLine("Значения, отвечающие данным условиям, записываются в третий массив.");
            Console.WriteLine("\nВыполнил студент: Карандашёв Роман\n");
            Console.WriteLine("Использование программы: LabWork3.exe [размер массива]\n");


            int n; //размерность массива
            if (args.Length == 0) //размерность определяется первым аргументом коммандной строки
            { n = 100; }          //если аргументов нет, размерность по умолчанию равен 100  
            else
            {
                try
                { n = Int32.Parse(args[0]); } //Обработка исключения. Если первый аргумент командной строки не int
                catch { Console.WriteLine("Неправильный аргумент!"); //Происходит выход из программы с ошибкой
                Environment.Exit(1);
                }
                finally { n = Int32.Parse(args[0]); }
                                
            }
            Console.WriteLine("Размерность массивов A и B: {0}", n);

            int[] massiveA = new int[n];
            int[] massiveB = new int[n];

            int[] massiveC = new int[0]; // В этот массив будут записываться повторяющиеся элементы
                                         // Поскольку неизвестно, сколько будет этих элементов,
                                         // Придётся каким-то образом превратить этот массив
                                         // в динамический))

            //Дальше нам необходимо инициализировать массивы A и B случайными числами 
            //В диапазоне от 0 до 2^16, то есть до 16384

            int MaxValue = 16384;
            Random rnd = new Random();
            for (int i = 0; i < massiveA.Length; i++) massiveA[i] = rnd.Next(0, MaxValue);

            //Выводим массив A на экран, с использованием метода ShowArray
            ShowArray(massiveA, "Массив А до сортировки:");

            //Теперь нужно выполнить ту же операцию для второго массива
            //Однако если мы её выполним сразу, он получит ровно те же значения
            //Поскольку генерация случайных чисел производится на основании показания
            //системных часов. Нужно подождать какое-то время. Для этого:

            Thread.Sleep(500); // Ждём 500 мсек, а затем инициализируем второй массив
            for (int i = 0; i < massiveB.Length; i++) massiveB[i] = rnd.Next(0, MaxValue);

            //Выводим массив B на экран с использованием метода ShowArray
            ShowArray(massiveB, "\nМассив B до сортировки");

            int t1 = Environment.TickCount; //Засекаем время выполнения программы
            
            //Теперь для поиска повторяющихся элементов в массиве A, его нужно сортировать Пузырьком
            //Для этого используем метод BubbleSort
            massiveA = BubbleSort(massiveA);
            // Выведем его на экран с помощью метода ShowArray

            ShowArray(massiveA, "\nМассив A после сортировки: ");

            //Повторяем сортировку и вывод на экран для массива B
            massiveB = BubbleSort(massiveB);
            ShowArray(massiveB, "\nМассив B после сортировки: ");

            //После выполнения предыдущих блоков, массив A и B являются упорядоченными
            // Теперь нужно найти в массиве А повторяющиеся значения, то есть следующий элемент
            // должен быть равным предыдущему

            int Temp = 0; //Для хранения значения повторяющегося элемента
            int Counter = 0; //Для определения позиции, куда записать значение в итоговом массиве C

            for (int i = 0; i < massiveA.Length - 1; i++) //для поиска повторяющихся элементов, последовательно обходим все элементы
            {
                if (massiveA[i] == massiveA[i + 1] && massiveA[i] != Temp) //если следующий элемент равен предыдущему 
                {                                                          //Записываем его в переменную Temp 
                    Temp = massiveA[i];                                    //Поскольку элементы могут повторяться более одного раза
                    for (int k = 0; k < massiveB.Length; k++)              //Проверяем, не записывалось ли значение в переменную ранее
                    {                                                      //Для каждого повторяющегося элемента проверяем его наличие во втором массиве
                        if (massiveB[k] == Temp)
                        {
                            Array.Resize(ref massiveC, massiveC.Length + 1);//Если совпадение найдено, увеличиваем размер массива C на единицу
                            massiveC[Counter] = Temp; //Записываем значение в массив С
                            Counter++;  //Увеличиваем счётчик на единицу
                            break;      //Поскольку нам надо записать только одно значение, выходит из цикла поиска
                        }               //совпадений
                    }
                }
            }

            int t2 = Environment.TickCount;//Отсановка замера времени. Сохраняем состояние
            int TotalTime = t2 - t1;
           
            if (massiveC.Length == 0)
            {
                Console.WriteLine("\nЭлементов, отвечающих условию задания нет.");
            }
            else
                { ShowArray(massiveC, "\nЭлементы, повторяющиеся в массиве A и встречющиеся в массиве B:"); }

        //Если время выполнения программы меньше 1000 мсек, выводим значение в миллисекундах, если больше - в секундах
        if (TotalTime < 1000) { Console.WriteLine("\nВремя выполнения программы: {0} мсек", TotalTime); }
        else { Console.WriteLine("\nВремя выполнения программы: {0} сек", TotalTime / 1000); }
            
        Console.WriteLine("");
        Console.WriteLine("Для выхода из программы нажмите любую клавишу");
        Console.ReadKey();


        }
    }
}


